
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21972)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4867
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:119"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"699dee3b-fbdb-42f9-b363-b54cbdff6316","JobName":"image-api_infrastructure_plan_prod","PRNumber":95,"Program":"tfcmt","SHA1":"288ccd78cc980c460c444d6f09414c6a420a897f","Target":"image-api-cdk","Vars":{}} -->